---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.PlanRegionFailures.InvalidPlanRegion
source: html/e1d9f35b-efd3-fd51-4fd7-b451eca80560.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PlanRegionFailures.InvalidPlanRegion Property

Plan region is invalid. The sketch of a plan region may not contain intersecting, overlapping or nested loops.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidPlanRegion { get; }
```